Revit 2027 API
ParameterTypeId.ViewPositionX Property
 "View Position X"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewPositionX { get; }
Public Shared ReadOnly Property ViewPositionX As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewPositionX {
	ForgeTypeId^ get ();
}
static member ViewPositionX : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace